gabrijelokorn/stm32f769DISCO/EmbSys/Core/Src/main.c
typedef struct _thread_info {
	uint8_t pid;
	int stack_space;
	int stack_size;
	uint32_t sent_messages;
	int time_running;
} thread_info;

int integer_length(int num) {
	int result = 0;
	if (num == 0) {
		return 1;
	}

	while (num > 0) {
		num /= 10;
		result++;
	}
	return result;
}


void fibonacci_display_num() {
	int number_strlen = integer_length(calculating);
	char number[number_strlen];
	sprintf(number, "%02d", calculating);
	BSP_LCD_DisplayStringAt(460, 230, (uint8_t*) number, LEFT_MODE);
}

void fibonacci_prepare() {
	BSP_LCD_FillRect(300, 150, 150, 200);
	BSP_LCD_DisplayStringAt(370, 230, (uint8_t*) "-", LEFT_MODE);
	BSP_LCD_FillRect(500, 150, 150, 200);
	BSP_LCD_DisplayStringAt(570, 230, (uint8_t*) "+", LEFT_MODE);
	fibonacci_display_num();
}

int fibonacci_inc (int num) {
	return ++num;
}

int fibonacci_dec (int num) {
	if (num <= 1) return 1;
	else return --num;
}

int fibonnaci_f (int num) {

	if (num == 0) {
		return 0;
	} else if (num == 1) {
		return 1;
	} else {
		return (fibonnaci_f(num - 1) + fibonnaci_f(num - 2));
	}
}

void fibonacci_t (void* args) {

	thread_info *fibonacci_info = malloc(sizeof(thread_info));
	fibonacci_info->pid = FIB + 1;
	fibonacci_info->sent_messages = 0;
	fibonacci_info->stack_size = FIBBIONACI_STACK_CAPACITY;
	fibonacci_info->time_running = 0;

	while (1) {
		fibonnaci_f(calculating);

		if (APP_PAGE == FIB) {
			int stack_space = osThreadGetStackSpace(fibonacci_taskHandle);
			fibonacci_info->stack_space = stack_space;

			if (osMessageQueuePut(thread_manager_message, &fibonacci_info, 0, osWaitForever) == osOK) {
				fibonacci_info->sent_messages += 1;
			}
			BSP_TS_GetState(&TS_State);
			if (TS_State.touchDetected > 0) {
				if (TS_State.touchY[0] > 300 && TS_State.touchX[0] < STACK_VIEW_WIDTH) {
					osThreadTerminate(fibonacci_taskHandle);
				} else if (TS_State.touchX[0] > 300 && TS_State.touchX[0] < 450 && TS_State.touchY[0] > 150 && TS_State.touchY[0] < 350) {
					calculating = fibonacci_dec(calculating);
				} else if (TS_State.touchX[0] > 500 && TS_State.touchX[0] < 650 && TS_State.touchY[0] > 150 && TS_State.touchY[0] < 350) {
					calculating = fibonacci_inc(calculating);
				}
				fibonacci_display_num(calculating);
			}
		}

		osDelay(20);
	}
}

bool grid[GOL_CELLS][GOL_CELLS];
osTimerId_t timer_gol;
bool GOL_running = true;

void prepare_gol() {
	BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
	BSP_LCD_FillRect(GOL_STARTPOINT_X, GOL_STARTPOINT_Y, GOL_BOX_SIZE, GOL_BOX_SIZE);
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);

	// draw horizontal lines
	for (int i = 0; i < GOL_CELLS; i++) {
		BSP_LCD_DrawHLine(GOL_STARTPOINT_X, GOL_STARTPOINT_Y + i * GOL_CELL_SIZE, GOL_BOX_SIZE);
	}

	// draw vertical lines
	for (int i = 0; i < GOL_CELLS; i++) {
		BSP_LCD_DrawVLine(GOL_STARTPOINT_X + i * GOL_CELL_SIZE, GOL_STARTPOINT_Y, GOL_BOX_SIZE);
	}
}

void gol_display_grid(bool grid[][GOL_CELLS]) {
	// draw horizontal lines
	for (int i = 0; i < GOL_CELLS; i++) {
		BSP_LCD_DrawHLine(GOL_STARTPOINT_X, GOL_STARTPOINT_Y + i * GOL_CELL_SIZE, GOL_BOX_SIZE);
	}

	// draw vertical lines
	for (int i = 0; i < GOL_CELLS; i++) {
		BSP_LCD_DrawVLine(GOL_STARTPOINT_X + i * GOL_CELL_SIZE, GOL_STARTPOINT_Y, GOL_BOX_SIZE);
	}

	for (int i = 0; i < GOL_CELLS; i++) {
		for (int j = 0; j < GOL_CELLS; j++) {
			if (grid[i][j] == true) {
				BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
			} else {
				BSP_LCD_SetTextColor(LCD_COLOR_WHITE);
			}
			BSP_LCD_FillRect(GOL_STARTPOINT_X + j * GOL_CELL_SIZE + 1, GOL_STARTPOINT_Y + i * GOL_CELL_SIZE + 1, GOL_CELL_SIZE - 1, GOL_CELL_SIZE - 1);
		}
	}
	BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
}


void gol_next_gen(bool grid[][GOL_CELLS]) {

	bool next_gen[GOL_CELLS][GOL_CELLS];

	for (int i = 0; i < GOL_CELLS; i++) {
		for (int j = 0; j < GOL_CELLS; j++) {
			next_gen[i][j] = grid[i][j];
		}
	}

	for (int i = 0; i < GOL_CELLS; i++) {
		for (int j = 0; j < GOL_CELLS; j++) {

			uint8_t neigh = 0;
			// count neigbours
			if (i > 0) {
				if (j > 0) {
					if (grid[i - 1][j - 1]) neigh++; // 1 - levo gor
				}
				if (grid[i - 1][j]) neigh++; // 2 - gor
				if (j < GOL_CELLS - 1) {
					if (grid[i - 1][j + 1]) neigh++; // 3 - desno gor
				}
			}
			if (i < GOL_CELLS - 1) {
				if (j > 0) {
					if (grid[i + 1][j - 1]) neigh++; // 4 - levo dol
				}
				if (grid[i + 1][j]) neigh++; // 5 - dol
				if (j < GOL_CELLS - 1) {
					if (grid[i + 1][j + 1]) neigh++; // 6 - desno dol
				}
			}
			if (j > 0) {
					if (grid[i][j - 1]) neigh++; // 7 - levo
			}
			if (j < GOL_CELLS - 1) {
					if (grid[i][j + 1]) neigh++; // 8 - desno
			}

			if (grid[i][j]) {
				if (!(neigh == 2 || neigh == 3)) {
					next_gen[i][j] = false;
				}
			} else {
				if (neigh == 3) {
					next_gen[i][j] = true;
				}
			}

		}
	}
	for (int i = 0; i < GOL_CELLS; i++) {
		for (int j = 0; j < GOL_CELLS; j++) {
			grid[i][j] = next_gen[i][j];
		}
	}
}

// && (osThreadGetState(game_of_life_taskHandle) == osThreadRunning || osThreadGetState(game_of_life_taskHandle) == osThreadReady)
void gol_timer_func(){
	if (APP_PAGE == GOL && GOL_running) {
		gol_display_grid(grid);
		gol_next_gen(grid);
	}
}



void game_of_life_t (void* args) {

	thread_info *gol_info = malloc(sizeof(thread_info));
	gol_info->pid = GOL + 1;
	gol_info->sent_messages = 0;
	gol_info->stack_size = GOL_STACK_CAPACITY;
	gol_info->time_running = 4;


	// initiate grid

	for (int i = 0; i < GOL_CELLS; i++) {
		for (int j = 0; j < GOL_CELLS; j++) {
			grid[i][j] = false;
		}
	}

	grid[3][4] = true;
	grid[4][3] = true;
	grid[4][4] = true;
	grid[4][5] = true;

	while(1) {
		if (APP_PAGE == GOL) {
			int stack_space = osThreadGetStackSpace(game_of_life_taskHandle);
			gol_info->stack_space = stack_space;

			if(osMessageQueuePut(thread_manager_message, &gol_info, 0, osWaitForever) == osOK) {
				gol_info->sent_messages += 1;
			}

			BSP_TS_GetState(&TS_State);
			if (TS_State.touchDetected > 0) {

				uint16_t x = (TS_State.touchX[0] - GOL_STARTPOINT_X) / GOL_CELL_SIZE;
				uint16_t y = (TS_State.touchY[0] - GOL_STARTPOINT_Y) / GOL_CELL_SIZE;

